README.md file updated with required changes
